# GetTexSpaceStartCap

## Description
Function GetTexSpaceStartCap returns whether the start cap of an extrude or sweep is textured.

```pascal
FUNCTION GetTexSpaceStartCap(textureSpace : HANDLE) : BOOLEAN;
```

```python

def vs.GetTexSpaceStartCap(textureSpace):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|textureSpace|HANDLE|Handle to texture space.|

## Remarks
Returns whether start cap of extrude or sweep is textured

## Version
```diff
- GetTexSpaceStartCap is obsolete as of Vectorworks 2009
```

Availability: from VectorWorks8.0
## Category
* Textures